test/vcr_cassettes/stripe_payment_service_test.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_intents
    body:
      encoding: UTF-8
      string: amount=2200&capture_method=automatic&confirmation_method=automatic&confirm=true&currency=usd&customer=cus_Il0otsjoN4ck5r&metadata[service_delivery_id]=298486374&metadata[customer_id]=113629430&payment_method_types[0]=card&payment_method=pm_card_visa&receipt_email=customer%40plowr.com
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.29.0
      Authorization:
      - Bearer sk_test_51I95ykL76OlF2WAccwl0HsRTmXYy2PKajyfplcPN6I19Q1GhPa4nHqBfUG0A47UtTfdaWekVZ8PX4ZesPyTI0a7800NBYMOaYi
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.29.0","lang":"ruby","lang_version":"2.6.6 p146 (2020-03-31)","platform":"x86_64-darwin18","engine":"ruby","publisher":"stripe","uname":"Darwin
        MacBook-Pro.local 18.6.0 Darwin Kernel Version 18.6.0: Thu Apr 25 23:16:27
        PDT 2019; root:xnu-4903.261.4~2/RELEASE_X86_64 x86_64","hostname":"MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 15 Jan 2021 10:09:13 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4446'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_bA0sgIw5C6pSH0
      Stripe-Version:
      - '2020-08-27'
      X-Stripe-C-Cost:
      - '10'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "pi_1I9pEyL76OlF2WAchUM0ZwgB",
          "object": "payment_intent",
          "amount": 2200,
          "amount_capturable": 0,
          "amount_received": 2200,
          "application": null,
          "application_fee_amount": null,
          "canceled_at": null,
          "cancellation_reason": null,
          "capture_method": "automatic",
          "charges": {
            "object": "list",
            "data": [
              {
                "id": "ch_1I9pEyL76OlF2WAce7nnGB4k",
                "object": "charge",
                "amount": 2200,
                "amount_captured": 2200,
                "amount_refunded": 0,
                "application": null,
                "application_fee": null,
                "application_fee_amount": null,
                "balance_transaction": "txn_1I9pEzL76OlF2WAczz3lDV1o",
                "billing_details": {
                  "address": {
                    "city": null,
                    "country": null,
                    "line1": null,
                    "line2": null,
                    "postal_code": null,
                    "state": null
                  },
                  "email": null,
                  "name": null,
                  "phone": null
                },
                "calculated_statement_descriptor": "Stripe",
                "captured": true,
                "created": 1610705352,
                "currency": "usd",
                "customer": "cus_Il0otsjoN4ck5r",
                "description": null,
                "destination": null,
                "dispute": null,
                "disputed": false,
                "failure_code": null,
                "failure_message": null,
                "fraud_details": {
                },
                "invoice": null,
                "livemode": false,
                "metadata": {
                  "service_delivery_id": "298486374",
                  "customer_id": "113629430"
                },
                "on_behalf_of": null,
                "order": null,
                "outcome": {
                  "network_status": "approved_by_network",
                  "reason": null,
                  "risk_level": "normal",
                  "risk_score": 31,
                  "seller_message": "Payment complete.",
                  "type": "authorized"
                },
                "paid": true,
                "payment_intent": "pi_1I9pEyL76OlF2WAchUM0ZwgB",
                "payment_method": "pm_1I9pExL76OlF2WAcX0EeVeIY",
                "payment_method_details": {
                  "card": {
                    "brand": "visa",
                    "checks": {
                      "address_line1_check": null,
                      "address_postal_code_check": null,
                      "cvc_check": null
                    },
                    "country": "US",
                    "exp_month": 1,
                    "exp_year": 2022,
                    "fingerprint": "Ii1VEeVORkAldhgU",
                    "funding": "credit",
                    "installments": null,
                    "last4": "4242",
                    "network": "visa",
                    "three_d_secure": null,
                    "wallet": null
                  },
                  "type": "card"
                },
                "receipt_email": "customer@plowr.com",
                "receipt_number": null,
                "receipt_url": "https://pay.stripe.com/receipts/acct_1I95ykL76OlF2WAc/ch_1I9pEyL76OlF2WAce7nnGB4k/rcpt_IlLwaLJBSWYteXnS9kY0aBUlc5BSTmb",
                "refunded": false,
                "refunds": {
                  "object": "list",
                  "data": [

                  ],
                  "has_more": false,
                  "total_count": 0,
                  "url": "/v1/charges/ch_1I9pEyL76OlF2WAce7nnGB4k/refunds"
                },
                "review": null,
                "shipping": null,
                "source": null,
                "source_transfer": null,
                "statement_descriptor": null,
                "statement_descriptor_suffix": null,
                "status": "succeeded",
                "transfer_data": null,
                "transfer_group": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/charges?payment_intent=pi_1I9pEyL76OlF2WAchUM0ZwgB"
          },
          "client_secret": "pi_1I9pEyL76OlF2WAchUM0ZwgB_secret_R216OLCq4nlprcq3qVDBAlQZe",
          "confirmation_method": "automatic",
          "created": 1610705352,
          "currency": "usd",
          "customer": "cus_Il0otsjoN4ck5r",
          "description": null,
          "invoice": null,
          "last_payment_error": null,
          "livemode": false,
          "metadata": {
            "service_delivery_id": "298486374",
            "customer_id": "113629430"
          },
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": "pm_1I9pExL76OlF2WAcX0EeVeIY",
          "payment_method_options": {
            "card": {
              "installments": null,
              "network": null,
              "request_three_d_secure": "automatic"
            }
          },
          "payment_method_types": [
            "card"
          ],
          "receipt_email": "customer@plowr.com",
          "review": null,
          "setup_future_usage": null,
          "shipping": null,
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": null,
          "status": "succeeded",
          "transfer_data": null,
          "transfer_group": null
        }
  recorded_at: Fri, 15 Jan 2021 10:09:48 GMT
recorded_with: VCR 6.0.0
